zephyrproject-rtos/zephyr/ext/hal/atmel/asf/sam/include/same70/component/mcan.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_BTP_OFFSET                     (0x1C)                                        /**<  (MCAN_BTP) Bit Timing and Prescaler Register  Offset */

#define MCAN_BTP_SJW_Pos                    0                                              /**< (MCAN_BTP) (Re) Synchronization Jump Width Position */
#define MCAN_BTP_SJW_Msk                    (_U_(0xF) << MCAN_BTP_SJW_Pos)                 /**< (MCAN_BTP) (Re) Synchronization Jump Width Mask */
#define MCAN_BTP_SJW(value)                 (MCAN_BTP_SJW_Msk & ((value) << MCAN_BTP_SJW_Pos))
#define MCAN_BTP_TSEG2_Pos                  4                                              /**< (MCAN_BTP) Time Segment After Sample Point Position */
#define MCAN_BTP_TSEG2_Msk                  (_U_(0xF) << MCAN_BTP_TSEG2_Pos)               /**< (MCAN_BTP) Time Segment After Sample Point Mask */
#define MCAN_BTP_TSEG2(value)               (MCAN_BTP_TSEG2_Msk & ((value) << MCAN_BTP_TSEG2_Pos))
#define MCAN_BTP_TSEG1_Pos                  8                                              /**< (MCAN_BTP) Time Segment Before Sample Point Position */
#define MCAN_BTP_TSEG1_Msk                  (_U_(0x3F) << MCAN_BTP_TSEG1_Pos)              /**< (MCAN_BTP) Time Segment Before Sample Point Mask */
#define MCAN_BTP_TSEG1(value)               (MCAN_BTP_TSEG1_Msk & ((value) << MCAN_BTP_TSEG1_Pos))
#define MCAN_BTP_BRP_Pos                    16                                             /**< (MCAN_BTP) Baud Rate Prescaler Position */
#define MCAN_BTP_BRP_Msk                    (_U_(0x3FF) << MCAN_BTP_BRP_Pos)               /**< (MCAN_BTP) Baud Rate Prescaler Mask */
#define MCAN_BTP_BRP(value)                 (MCAN_BTP_BRP_Msk & ((value) << MCAN_BTP_BRP_Pos))
#define MCAN_BTP_MASK                       _U_(0x3FF3FFF)                                 /**< \deprecated (MCAN_BTP) Register MASK  (Use MCAN_BTP_Msk instead)  */
#define MCAN_BTP_Msk                        _U_(0x3FF3FFF)                                 /**< (MCAN_BTP) Register Mask  */


/* -------- MCAN_TSCC : (MCAN Offset: 0x20) (R/W 32) Timestamp Counter Configuration Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TSS:2;                     /**< bit:   0..1  Timestamp Select                         */
    uint32_t :14;                       /**< bit:  2..15  Reserved */
    uint32_t TCP:4;                     /**< bit: 16..19  Timestamp Counter Prescaler              */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_TSCC_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_TSCC_OFFSET                    (0x20)                                        /**<  (MCAN_TSCC) Timestamp Counter Configuration Register  Offset */

#define MCAN_TSCC_TSS_Pos                   0                                              /**< (MCAN_TSCC) Timestamp Select Position */
#define MCAN_TSCC_TSS_Msk                   (_U_(0x3) << MCAN_TSCC_TSS_Pos)                /**< (MCAN_TSCC) Timestamp Select Mask */
#define MCAN_TSCC_TSS(value)                (MCAN_TSCC_TSS_Msk & ((value) << MCAN_TSCC_TSS_Pos))
#define   MCAN_TSCC_TSS_ALWAYS_0_Val        _U_(0x0)                                       /**< (MCAN_TSCC) Timestamp counter value always 0x0000  */
#define   MCAN_TSCC_TSS_TCP_INC_Val         _U_(0x1)                                       /**< (MCAN_TSCC) Timestamp counter value incremented according to TCP  */
#define   MCAN_TSCC_TSS_EXT_TIMESTAMP_Val   _U_(0x2)                                       /**< (MCAN_TSCC) External timestamp counter value used  */
#define MCAN_TSCC_TSS_ALWAYS_0              (MCAN_TSCC_TSS_ALWAYS_0_Val << MCAN_TSCC_TSS_Pos)  /**< (MCAN_TSCC) Timestamp counter value always 0x0000 Position  */
#define MCAN_TSCC_TSS_TCP_INC               (MCAN_TSCC_TSS_TCP_INC_Val << MCAN_TSCC_TSS_Pos)  /**< (MCAN_TSCC) Timestamp counter value incremented according to TCP Position  */
#define MCAN_TSCC_TSS_EXT_TIMESTAMP         (MCAN_TSCC_TSS_EXT_TIMESTAMP_Val << MCAN_TSCC_TSS_Pos)  /**< (MCAN_TSCC) External timestamp counter value used Position  */
#define MCAN_TSCC_TCP_Pos                   16                                             /**< (MCAN_TSCC) Timestamp Counter Prescaler Position */
#define MCAN_TSCC_TCP_Msk                   (_U_(0xF) << MCAN_TSCC_TCP_Pos)                /**< (MCAN_TSCC) Timestamp Counter Prescaler Mask */
#define MCAN_TSCC_TCP(value)                (MCAN_TSCC_TCP_Msk & ((value) << MCAN_TSCC_TCP_Pos))
#define MCAN_TSCC_MASK                      _U_(0xF0003)                                   /**< \deprecated (MCAN_TSCC) Register MASK  (Use MCAN_TSCC_Msk instead)  */
#define MCAN_TSCC_Msk                       _U_(0xF0003)                                   /**< (MCAN_TSCC) Register Mask  */


/* -------- MCAN_TSCV : (MCAN Offset: 0x24) (R/W 32) Timestamp Counter Value Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t TSC:16;                    /**< bit:  0..15  Timestamp Counter (cleared on write)     */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_TSCV_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define MCAN_TSCV_OFFSET                    (0x24)                                        /**<  (MCAN_TSCV) Timestamp Counter Value Register  Offset */

#define MCAN_TSCV_TSC_Pos                   0                                              /**< (MCAN_TSCV) Timestamp Counter (cleared on write) Position */
#define MCAN_TSCV_TSC_Msk                   (_U_(0xFFFF) << MCAN_TSCV_TSC_Pos)             /**< (MCAN_TSCV) Timestamp Counter (cleared on write) Mask */
#define MCAN_TSCV_TSC(value)                (MCAN_TSCV_TSC_Msk & ((value) << MCAN_TSCV_TSC_Pos))
#define MCAN_TSCV_MASK                      _U_(0xFFFF)                                    /**< \deprecated (MCAN_TSCV) Register MASK  (Use MCAN_TSCV_Msk instead)  */
#define MCAN_TSCV_Msk                       _U_(0xFFFF)                                    /**< (MCAN_TSCV) Register Mask  */


/* -------- MCAN_TOCC : (MCAN Offset: 0x28) (R/W 32) Timeout Counter Configuration Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ETOC:1;                    /**< bit:      0  Enable Timeout Counter                   */
    uint32_t TOS:2;                     /**< bit:   1..2  Timeout Select                           */
    uint32_t :13;                       /**< bit:  3..15  Reserved */
    uint32_t TOP:16;                    /**< bit: 16..31  Timeout Period                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} MCAN_TOCC_Type;
